import doctor1 from "@/assets/doctors/1.png";
import doctor2 from "@/assets/doctors/2.png";
import doctor3 from "@/assets/doctors/3.png";
import doctor4 from "@/assets/doctors/4.png";
import doctor5 from "@/assets/doctors/5.png";
import doctor6 from "@/assets/doctors/6.png";
import doctor7 from "@/assets/doctors/7.png";
import doctor8 from "@/assets/doctors/8.png";
import doctor9 from "@/assets/doctors/9.png";
import doctor10 from "@/assets/doctors/10.png";
import doctor11 from "@/assets/doctors/11.png";
import doctor12 from "@/assets/doctors/12.png";
import doctor13 from "@/assets/doctors/13.png";
import doctor15 from "@/assets/doctors/15.png";
import doctor16 from "@/assets/doctors/16.png";
import doctor17 from "@/assets/doctors/17.png";
import doctor18 from "@/assets/doctors/18.png";
import doctor19 from "@/assets/doctors/19.png";
import doctor20 from "@/assets/doctors/20.png";
import doctor22 from "@/assets/doctors/22.png";
import { type SpecialistInfo } from "@/app/lib/types";

export const serviceDoctors: SpecialistInfo[] = [
  {
    src: doctor1,
    name: "Хагай Елена Игоревна",
    role: "Детский кардиолог",
    exp: "8+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Кардиология",
    description:
      "Опытный детский кардиолог, специализируется на врождённых и приобретённых заболеваниях сердца у детей.",
  },
  {
    src: doctor9,
    name: "Талгат Асылбек Талгатулы",
    role: "Детский инфекционист",
    exp: "12+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Инфекционные болезни / Иммунология",
    description:
      "Эксперт по диагностике и лечению инфекционных заболеваний у детей, с акцентом на иммунологические нарушения.",
  },
  {
    src: doctor18,
    name: "Сарсекеева Асем Шакеровна",
    role: "Детский кардиолог",
    exp: "8+ лет",
    level: "Врач первой категории",
    since: 2020,
    group: "Кардиология",
    description:
      "Специалист по детской кардиологии, обеспечивает комплексное лечение маленьких пациентов с заболеваниями сердца.",
  },
  {
    src: doctor13,
    name: "Темирбулатов Ринат Хамзаевич",
    role: "Врач ультразвуковой диагностики",
    exp: "12+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Диагностическая визуализация",
    description:
      "Высококвалифицированный специалист по ультразвуковой диагностике для точного и своевременного выявления заболеваний.",
  },
  {
    src: doctor5,
    name: "Наукенова Бахыт Кастаевна",
    role: "Взрослый кардиолог",
    exp: "12+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Кардиология",
    description:
      "Оказывает экспертную помощь в области кардиологии взрослых, с акцентом на профилактику и лечение сердечно-сосудистых заболеваний.",
  },
  {
    src: doctor10,
    name: "Онбаева Асель Русланова",
    role: "Врач-педиатр",
    exp: "8+ лет",
    level: "Врач неотложной помощи",
    since: 2020,
    group: "Терапия / Общая медицина",
    description:
      "Педиатр с опытом работы в неотложной помощи и профилактической медицине для детей.",
  },
  {
    src: doctor2,
    name: "Иманов Арман Казиретович",
    role: "Детский невролог",
    exp: "12+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Неврология / Нейрохирургия",
    description:
      "Специалист по детской неврологии, лечит широкий спектр неврологических заболеваний у детей.",
  },
  {
    src: doctor8,
    name: "Асылхан Нуржан Канатович",
    role: "Сосудистый хирург",
    exp: "8+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Хирургия / Общая хирургия",
    description:
      "Опытный сосудистый хирург, владеет минимально инвазивными и открытыми хирургическими методиками.",
  },
  {
    src: doctor7,
    name: "Рафиков Фарух Фаридович",
    role: "Взрослый и детский невролог",
    exp: "12+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Неврология / Нейрохирургия",
    description:
      "Невролог, лечит как взрослых, так и детей, специализируется на сложных неврологических состояниях.",
  },
  {
    src: doctor6,
    name: "Могер Наталья Борисовна",
    role: "Врач-педиатр",
    exp: "8+ лет",
    level: "Врач первой категории",
    since: 2020,
    group: "Терапия / Общая медицина",
    description:
      "Педиатр, предоставляющий комплексную медицинскую помощь детям всех возрастов.",
  },
  {
    src: doctor4,
    name: "Шайкенов Алмас Мерекулы",
    role: "Кардиохирург",
    exp: "12+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Кардиология",
    description:
      "Кардиохирург с большим опытом проведения операций на сердце и послеоперационного ведения пациентов.",
  },
  {
    src: doctor3,
    name: "Темиргалиев Галымжан Абаевич",
    role: "Онколог-маммолог",
    exp: "8+ лет",
    level: "Врач первой категории",
    since: 2020,
    group: "Онкология / Маммология",
    description:
      "Онколог, специализируется на лечении рака молочной железы и маммологии, предлагает современные методы терапии.",
  },
  {
    src: doctor22,
    name: "Тулеугазинова Айгерим Еркынова",
    role: "Аллерголог",
    exp: "12+ лет",
    level: "Врач первой категории",
    since: 2020,
    group: "Инфекционные болезни / Иммунология",
    description:
      "Аллерголог-иммунолог, занимается лечением аллергий и нарушений иммунной системы.",
  },
  {
    src: doctor17,
    name: "Сабеков Ринат Дулатбекович",
    role: "Сосудистый хирург",
    exp: "12+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Хирургия / Общая хирургия",
    description:
      "Проводит сосудистые операции с акцентом на безопасность пациента и оптимальные результаты.",
  },
  {
    src: doctor20,
    name: "Райханов Мурат Арыстанович",
    role: "Кардиолог",
    exp: "12+ лет",
    level: "Врач первой категории",
    since: 2020,
    group: "Кардиология",
    description:
      "Кардиолог, занимается диагностикой и лечением широкого спектра сердечно-сосудистых заболеваний.",
  },
  {
    src: doctor16,
    name: "Смаилов Совет Сляммуратович",
    role: "Детский хирург",
    exp: "12+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Хирургия / Общая хирургия",
    description:
      "Детский хирург, специализируется на хирургической помощи детям и подросткам.",
  },
  {
    src: doctor19,
    name: "Муканова Гульнара Халеловна",
    role: "Врач-кардиолог",
    exp: "12+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Кардиология",
    description:
      "Опытный кардиолог, уделяет особое внимание профилактике и обучению пациентов.",
  },
  {
    src: doctor15,
    name: "Жусупов Сабит Муталяпович",
    role: "Сосудистый хирург",
    exp: "12+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Хирургия / Общая хирургия",
    description:
      "Сосудистый хирург, специализируется на лечении сложных сосудистых заболеваний.",
  },
  {
    src: doctor12,
    name: "Муратов Даниил Ринатович",
    role: "Уролог-андролог",
    exp: "12+ лет",
    level: "Врач высшей категории",
    since: 2020,
    group: "Урология / Нефрология",
    description:
      "Уролог-андролог, специализируется на мужском репродуктивном и мочеполовом здоровье.",
  },
  {
    src: doctor11,
    name: "Тулеубаев Мусаип Мусаевич",
    role: "Травматолог-ортопед",
    exp: "12+ лет",
    level: "Врач первой категории",
    since: 2020,
    group: "Травматология / Ортопедия",
    description:
      "Травматолог-ортопед, оказывает помощь при травмах и заболеваниях опорно-двигательного аппарата.",
  },
];
